//http://localhost:5000/api/v1/auth
const express = require("express");

const authRouter = express.Router();

// Registration  (signup)
// створити ендпоінтт реєстрації користувача

// LogIn     (signin)
// створити ендпоінт логінізації користувача

// 🟨Написати прошарок авторизації  (хз що це)

// Get info about user
// створити ендпоінт на отримання інформації про користувача

// Refresh
// створити ендпоінт для оновлення данних користувача або одного з полів контактної інформації про користувача

// LogOut
// створити ендпоінт для логаута користувача

module.exports = authRouter;
